2019-02-09-emms.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/faq/rss.xml"
      title="RSS feed for https://martiyo.github.io/faq/"
    />
    <title>Reproducir audio en emacs</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/faq">/home</a></li>
          <li><a href="https://martiyo.github.io/faq/about">/about</a></li>
          <li><a href="https://martiyo.github.io/faq/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">09 feb 2019</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/faq/2019-02-09-emms.html"
          >Reproducir audio en emacs</a
        >
      </h1>

      <div id="outline-container-org154293e" class="outline-2">
        <h2 id="emms"><a id="org154293e"></a>Emms</h2>
        <div class="outline-text-2" id="text-emms">
          <p>
            Emms es el sistema multimedia de Emacs. Intenta ser una aplicación
            limpia y pequeña para reproducir archivos multimedia de Emacs
            utilizando reproductores externos.
          </p>
        </div>
      </div>

      <div id="outline-container-orge860944" class="outline-2">
        <h2 id="instalación"><a id="orge860944"></a>Instalación</h2>
        <div class="outline-text-2" id="text-instalación">
          <p>
            Para poder escuchar musica en emacs primero hay que instalar el
            paquete
            <b>emms</b> con apt, luego descargar tar.gz de emms y moverlo al
            directorio emacs.d:
          </p>

          <pre class="example">
wget http://ftp.gnu.org/gnu/emms/emms-4.0.tar.gz
tar -zxf emms-4.0.tar.gz
mv emms-4.0 .emacs.d/lisp
</pre
          >

          <p>Editar el archivo .emacs y añadir las siguientes lineas:</p>

          <pre class="example">
(add-to-list 'load-path "~/.emacs.d/lisp/emms-4.0/")
(require 'emms-setup)
(emms-standard)
(emms-default-players)
</pre
          >

          <p>
            <b>C-x s</b> guarda los cambios <b>M-x ev-b</b> recarga la
            configuración sin necesidad de reiniciar emacs, luego
            <b>M-x emms</b> TAB TAB muestra una ventana con las opciones
            disponibles.
          </p>
        </div>

        <div id="outline-container-org6ee8b3b" class="outline-3">
          <h3 id="navegar-por-el-sistema-de-archivos">
            <a id="org6ee8b3b"></a>Navegar por el sistema de archivos
          </h3>
          <div
            class="outline-text-3"
            id="text-navegar-por-el-sistema-de-archivos"
          >
            <p>
              El comando <b>M-x emms-play-file</b> permite navegar por el
              sistema de archivos y elegir un archivo de audio para reproducir,
              <b>M-x emms</b> muestra la playlist y <b>M-x emm-stop</b> detiene
              la reproducción. Es posible establecer un directorio
              predeterminado para la carpeta <b>musica</b>
              editando el archivo .emacs como siempre y agregando esto:
            </p>

            <pre class="example">
(setq emms-source-file-default-directory "~/Musica/")
</pre
            >

            <p>
              esta linea permite acceder directamente a ese directorio tipeando
              <b>M-x emms</b>
            </p>
          </div>
        </div>

        <div id="outline-container-orgb57979b" class="outline-3">
          <h3 id="escuchar-radios"><a id="orgb57979b"></a>Escuchar radios</h3>
          <div class="outline-text-3" id="text-escuchar-radios">
            <p>
              Para escuchar radios, hay que crear un archivo con las URL de las
              radios de y ejecutar <b>M-x emms-play-m3u-playlist</b> y navegar
              hasta dicho archivo, pero para hacerla mas fácil se puede crear un
              atajo en .emmacs con:
            </p>

            <pre class="example">
(global-set-key (kbd "C-c r") 'emms-play-m3u-playlist)
</pre
            >

            <p>
              ahora para cargar el archivo radios que está en la carpeta Musica
              basta con <b>C-c r</b>
            </p>
          </div>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/faq/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/faq/tag-emacs.html">emacs</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/faq/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
